app/controllers/customers_controller.rb

  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save
---
INSERT INTO "customers" ("first_name", "last_name", "phone_number", "location", "tags", "created_at", "updated_at", "sex", "company_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"